//---------------------------------------------------------------------------
/*
	TVP2 ( T Visual Presenter 2 )  A script authoring tool
	Copyright (C) 2000 W.Dee <dee@kikyou.info> and contributors

	See details of license at "license.txt"
*/
//---------------------------------------------------------------------------
// File Selector dialog box
//---------------------------------------------------------------------------
#include "tjsCommHead.h"

//---------------------------------------------------------------------------
// TVPSelectFile related
// OS固有のファイル選択ダイアログを表示する
//---------------------------------------------------------------------------
bool TVPSelectFile(iTJSDispatch2 *params)
{
	return false;
}
//---------------------------------------------------------------------------


