//---------------------------------------------------------------------------
/*
*/
//---------------------------------------------------------------------------
// Clipboard Class interface
//---------------------------------------------------------------------------
#include "tjsCommHead.h"
#include "MsgIntf.h"
#include "Exception.h"

//---------------------------------------------------------------------------
// clipboard related functions
//---------------------------------------------------------------------------
bool TVPClipboardHasFormat(tTVPClipboardFormat format)
{
	// サポートタイプかチェックする
	return false;
}
//---------------------------------------------------------------------------
void TVPClipboardSetText(const ttstr & text)
{
	// クリップボードに文字列を送る
}
//---------------------------------------------------------------------------
bool TVPClipboardGetText(ttstr & text)
{
	// クリップボードから文字列を得る
	return false;
}
//---------------------------------------------------------------------------

