//---------------------------------------------------------------------------
/*
	See details of license at "license.txt"
	
	Android 版は Clipboard 機能を持たない
*/
//---------------------------------------------------------------------------
// Clipboard Class interface
//---------------------------------------------------------------------------
#include "tjsCommHead.h"
#include "ClipboardIntf.h"

//---------------------------------------------------------------------------
// clipboard related functions
//---------------------------------------------------------------------------
bool TVPClipboardHasFormat(tTVPClipboardFormat format)
{
	return false;
}
//---------------------------------------------------------------------------
void TVPClipboardSetText(const ttstr & text)
{
}
//---------------------------------------------------------------------------
bool TVPClipboardGetText(ttstr & text)
{
	return false;
}
//---------------------------------------------------------------------------

